<b>Example dataframe</b>

In [1]:
import pandas as pd

D = {
    'id': [0, 1, 2, 3],
    'name': ['Song', 'Biden', 'Biden', 'Potato'],
    'score': [100, 10, 20, 90]
}

df = pd.DataFrame(D)
df.set_index('id', inplace=True)

df

      name  score
id
0     Song    100
1    Biden     10
2    Biden     20
3   Potato     90

<b>Modify the data in a sub dataframe</b>

In [2]:
sub_df = df.loc[df.index <= 2, :]
sub_df.loc[sub_df.index == 1, 'name'] = 'modified in sub_df'

sub_df

                  name  score
id
0                 Song    100
1   modified in sub_df     10
2                Biden     20

<b>The original dataframe is not modified, a sub_frame is a deep copy</b>

In [3]:
df

      name  score
id
0     Song    100
1    Biden     10
2    Biden     20
3   Potato     90